app/Http/Controllers/Admin/Api/ColorController.php

    public function index(Request $request, $id)
    {
        //obtener colores al actualizar stock en el modal
        if (! request()->ajax()) {
            abort(401, 'Acceso denegado');
        }

        $colores = Color::join('color_producto', 'colores.id', 'color_producto.color_id')
            ->where('color_producto.producto_id', $id)
            ->get();
---
select * from `colores` inner join `color_producto` on `colores`.`id` = `color_producto`.`color_id` where `color_producto`.`producto_id` = '9'