app/Http/Controllers/Admin/Api/SubcategoryController.php

    public function index(Request $request)
    {
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        $id  = $request->categoria;
        $subcategorias = Subcategoria::where('categoria_id', $id)->get();
---
select * from `subcategorias` where `categoria_id` = '2'