app/Http/Controllers/Admin/Api/TallaController.php

select * from `productos` where `id` = '9' limit 1
select * from `tallas` inner join `talla_tipo` on `tallas`.`id` = `talla_tipo`.`talla_id` where `talla_tipo`.`tipo_id` = 2
---
    public function index(Request $request, $id)
    {
       //obtener tallas al actualizar stock en el modal

       try {

           $tipo = Producto::where('id', $id)->firstOrFail();

           $tallas = Talla::join('talla_tipo', 'tallas.id', 'talla_tipo.talla_id')
           ->where('talla_tipo.tipo_id', $tipo->tipo_id)
           ->get();