app/Http/Controllers/Admin/Api/VentasController.php

select * from `ventas` where not exists (select * from `envios` where `ventas`.`id` = `envios`.`venta_id`) and `cliente_id` = 1
---
    public function obtener(Request $request, Cliente $cliente)
    {
        // if (!$request->ajax()) return redirect('/');
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        try {

            $ventas = Venta::doesntHave('envio')
                ->where('cliente_id', $cliente->id)
                ->get();