app/Services/ProductService.php

insert into `productos` (`nombre`, `tipo_id`, `marca`, `precio_anterior`, `precio_actual`, `porcentaje_descuento`, `descripcion_corta`, `descripcion_larga`, `especificaciones`, `estado`, `slider_principal`, `updated_at`, `created_at`) values ('Short dama', '9', 'Lorgeliz', '45000', '45000', '0', '<p>Short dama</p>', '<p>Short dama</p>', '<ul>\r\n	<li>Elaborado en denim</li>\r\n	<li>Colores surtidos</li>\r\n</ul>', '1', 'No', '2023-03-19 13:39:27', '2023-03-19 13:39:27')
---
    public function createProduct(Request $request)
    {

        $producto = new Producto();

        $producto->nombre = $request->nombre;
        $producto->tipo_id = $request->tipo_id;
        $producto->marca = $request->marca;
        $producto->precio_anterior = $request->precioanterior;
        $producto->precio_actual = $request->precioactual;
        $producto->porcentaje_descuento = $request->porcentajededescuento;
        $producto->descripcion_corta = $request->descripcion_corta;
        $producto->descripcion_larga = $request->descripcion_larga;
        $producto->especificaciones = $request->especificaciones;
        $producto->estado = $request->estado;

        if ($request->sliderprincipal) {
            $producto->slider_principal = 'Si';
        } else {
            $producto->slider_principal = 'No';
        }


        $producto->save();

select * from `color_producto` where `slug` = 'short-dama-azul marino' and `color_id` = '1' and `producto_id` = 49 limit 1
insert into `color_producto` (`producto_id`, `color_id`, `slug`) values (49, '1', 'short-dama-azul marino')
insert into `imagenes` (`url`, `imageable_id`, `imageable_type`, `updated_at`, `created_at`) values ('imagenes/productos/producto_49/1679251167_IMG-20210303-WA0070.jpg', 38, 'App\ColorProducto', '2023-03-19 13:39:29', '2023-03-19 13:39:29')
---
    public function createColorProducto(Request $request, Producto $producto, $url_imagenes)
    {

        if ($request->activo) {
            $activo = 'Si';
        }
        else {
            $activo = 'No';
        }

        $colorproducto = ColorProducto::create([
            'producto_id'=>$producto->id,
            'color_id' => $request->color,
            'activo' => $activo
        ]);


        $color_producto = ColorProducto::where('slug', $colorproducto->slug)
            ->where('color_id', $colorproducto->color_id)
            ->where('producto_id', $colorproducto->producto_id)
            ->first();


        $color_producto->imagenes()->createMany($url_imagenes);