app/Http/Controllers/Api/ProductController.php

    public function setVisitas(Request $request, $id)
    {
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        $producto = ColorProducto::where('id', $id)->first();

        $producto->visitas += 1;

        $producto->save(); // se incrementa el campo visitas
---
select * from `color_producto` where `id` = '34' limit 1
update `color_producto` set `visitas` = 3 where `id` = 34