app/Http/Controllers/Api/TallaController.php

    public function index(Request $request, $id)
    {
        //obtener tallas en la vista productos de la tienda

        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        try {

            $tallas = Talla::join('producto_referencia', 'tallas.id', '=', 'producto_referencia.talla_id')
            ->join('color_producto', 'producto_referencia.color_producto_id', '=', 'color_producto.id')
            ->where('producto_referencia.color_producto_id', $id)
            ->where('producto_referencia.stock', '>', '0')
            ->select('tallas.*', 'producto_referencia.stock')
            ->get();
---
select `tallas`.*, `producto_referencia`.`stock` from `tallas` inner join `producto_referencia` on `tallas`.`id` = `producto_referencia`.`talla_id` inner join `color_producto` on `producto_referencia`.`color_producto_id` = `color_producto`.`id` where `producto_referencia`.`color_producto_id` = '34' and `producto_referencia`.`stock` > '0'