app/ProductoReferencia.php

    public static function obtenerProducto ($producto,$talla){

        // return ProductoReferencia::join('color_producto', 'producto_referencia.color_producto_id', '=', 'color_producto.id')
        // ->join('productos', 'color_producto.producto_id', '=','productos.id')
        // ->where('producto_referencia.color_producto_id', $producto)
        // ->where('producto_referencia.talla_id', $talla)
        // ->select('producto_referencia.id as referencia', 'productos.precio_actual', 'producto_referencia.stock')
        // ->get();

        try {

            return ProductoReferencia::with('colorProducto.producto:id,precio_actual')
                ->where('color_producto_id', $producto)
                ->where('talla_id', $talla)
                ->get();
---
select * from `color_producto` where `color_producto`.`id` in (18)
select * from `producto_referencia` where `color_producto_id` = 18 and `talla_id` = 4
select `id`, `precio_actual` from `productos` where `productos`.`id` in (38)

    public static function disponibles(){

        try {

            return ProductoReferencia::where('stock', '>' , '0')
                ->groupBy('color_producto_id')
                ->select('color_producto_id')
                ->get();
---
select `color_producto_id` from `producto_referencia` where `stock` > '0' group by `color_producto_id`