app/Http/Controllers/CarController.php

    public function cartUser(Request $request)
    {
        if (!$request->ajax()) return redirect('/');

        $cliente = Cliente::where('user_id',auth()->user()->id)->firstOrFail();
---
select * from `clientes` where `user_id` = 2 limit 1