app/Http/Controllers/CarController.php

    public function index()
    {

        //$cliente = Cliente::where('user_id',auth()->user()->id)->firstOrFail();

        $cliente = auth()->user()->cliente;

        // $productos = Producto::
        // join('color_producto','productos.id', 'color_producto.producto_id')
        // ->join('imagenes', 'color_producto.id', 'imagenes.imageable_id')
        // ->join('colores', 'color_producto.color_id', 'colores.id')
        // ->join('producto_referencia', 'color_producto.id', 'producto_referencia.color_producto_id')
        // ->join('tallas','producto_referencia.talla_id', 'tallas.id')
        // ->join('carrito_producto', 'carrito_producto.producto_referencia_id','producto_referencia.id')
        // ->join('carritos','carritos.id', 'carrito_producto.carrito_id')
        // ->select('productos.id as codigo','productos.nombre', 'productos.precio_actual',
        // 'productos.descripcion_corta','color_producto.slug', 'carritos.total as total',
        // 'carrito_producto.cantidad', 'carritos.id as carrito', 'colores.nombre as color',
        // 'color_producto.id as cop','tallas.nombre as talla', 'producto_referencia.id as ref',
        // 'producto_referencia.stock', 'imagenes.url as imagen')
        // ->where('carritos.estado', 1)
        // ->where('carritos.cliente_id', $cliente->id)
        // ->where('imagenes.imageable_type', 'App\ColorProducto')
        // ->groupBy('producto_referencia.id')
        // //->groupBy('color_producto.id')
        // ->get();

        $productos = CarritoProducto::whereHas('carrito',
        function (Builder $query) use ($cliente) {
           $query->where('estado', 1)
           ->where('cliente_id', $cliente->id);
        })
        ->with(['carrito', 'productoReferencia'])
        ->get();
---
select * from `carritos` where `carritos`.`id` in (156)
select * from `producto_referencia` where `producto_referencia`.`id` in (7, 11, 35, 37, 38)
select * from `productos` where `productos`.`id` in (8, 11, 38, 45)

    public function update(Request $request)
    {
        if (!$request->ajax()) return redirect('/');

        try {

            DB::beginTransaction();

            $carrito = Carrito::where('id', $request->carrito)->firstOrFail(); //se busca el carrito del usuario

            $producto = ProductoReferencia::obtenerProducto($request->producto,$request->talla);


            $total = $carrito->total;
            // $precio = $producto[0]->precio_actual;
            $precio = $producto[0]->colorProducto->producto->precio_actual;

            $carrito->total = ($request->cantidad * $precio) + $total; //se actualiza el total del carrito

            // $cart = CarritoProducto::where('carrito_id',$carrito->id)
            // ->where('producto_referencia_id',$producto[0]->referencia)// se comprueba si el producto ha sido agregado antes
            // ->first();

            $cart = CarritoProducto::where('carrito_id',$carrito->id)
                ->where('producto_referencia_id',$producto[0]->id)// se comprueba si el producto ha sido agregado antes
                ->first();
---
select * from `carritos` where `id` = 156 limit 1
select * from `carrito_producto` where `carrito_id` = 156 and `producto_referencia_id` = 35 limit 1

                $carritoProducto->carrito_id = $carrito->id;
                $carritoProducto->cantidad = $request->cantidad;

                $carritoProducto->save();
            }

            $carrito->save();
---
update `carrito_producto` set `cantidad` = 7 where `id` = 271
update `carritos` set `subtotal` = 929265, `total` = 937265, `carritos`.`updated_at` = '2023-03-14 13:54:10' where `id` = 156