app/Http/Controllers/ChatController.php

select * from `chats` where `from_id` = 2 or `to_id` = 2 order by `created_at` asc
select * from `users` where `users`.`id` in (2, 3, 4, 11)
---
    public function index(Request $request)
    {
        // if (!$request->ajax()) return back();
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        $user = auth()->user()->id;

        // $chats = Chat::where('chats.from_id', $user)
        // ->orWhere('chats.to_id',$user)
        // ->join('users', 'chats.from_id', 'users.id')
        // ->join('imagenes', function ($join) {
        //     $join->on('users.id', '=', 'imagenes.imageable_id')
        //     ->where('imagenes.imageable_type','App\User');
        // })
        // ->select('chats.*','users.nombres', 'imagenes.url')
        // ->orderBy('chats.fecha')
        // ->get();

        try {

            $chats = Chat::with('user.imagene')
                ->where('from_id', $user)
                ->orWhere('to_id', $user)
                ->orderBy('created_at')
                ->get();

select * from `chats` where `to_id` = 2 and `read_at` is null order by `created_at` desc
select * from `users` where `users`.`id` in (3)
---
    public function messages(Request $request)
    {

        // if (!$request->ajax()) return redirect('/cuenta');
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        try {

            $user = auth()->user()->id;


            $chats = Chat::with('user.imagene')
            ->where('to_id', $user)
            ->whereNull('read_at')
            ->orderBy('created_at', 'DESC')
            ->get();