app/Http/Controllers/DevolucionController.php

select `id` from `ventas` where `ventas`.`id` in (17, 18, 20, 22)
---
    public function index(Request $request)
    {
        $busqueda = $request->busqueda;


        try {

            $productos = Devolucione::whereHas('venta',
            function (Builder $query) {
               $query->where('cliente_id', auth()->user()->cliente->id);
            })
            ->with(['venta', 'productoReferencia'])
            ->paginate(5);

select count(*) as aggregate from `devoluciones` where `producto_referencia_id` = 13 and `venta_id` = 128
insert into `devoluciones` (`fecha`, `cantidad`, `producto_referencia_id`, `venta_id`, `updated_at`, `created_at`) values ('2023-02-22 13:52:43', 1, 13, 128, '2023-02-22 13:52:43', '2023-02-22 13:52:43')
select * from `users` where `role_id` = 2 limit 1
---
    public function store(Request $request)
    {

        //podría implementare en api
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        try {

            $producto = $request->producto;
            $venta = $request->venta;
            $cantidad = $request->cantidad;

            $devoluciones = Devolucione::where('producto_referencia_id', $producto)//$ref
                ->where('venta_id', $venta)
                ->count(); // verificamos que no se haya solicitado la devolución anteriormente

            if ($devoluciones == 0) {
                $devolucion = new Devolucione();
                $devolucion->fecha = \Carbon\Carbon::now();
                $devolucion->cantidad = $cantidad;
                $devolucion->producto_referencia_id = $producto; //$ref
                $devolucion->venta_id = $venta;

                $devolucion->save();

                $admin = User::where('role_id', 2)->first();