app/Http/Controllers/HomeController.php

select * from `productos` where `productos`.`id` in (23, 43, 45)
select `id`, `nombre` from `tipos` where `tipos`.`id` in (3, 6)
---
    public function getProductos(Request $request)
    {
        //obtener todos los productos, en vista categorías
        if (!request()->ajax()) {
            abort(401, 'Acceso denegado');
        }

        $disponibles = ProductoReferencia::disponibles();

        $productos = ColorProducto::with(['producto.tipo:id,nombre', 'color:id,nombre', 'imagenes'])
            // ->where('activo', 'Si')
            ->activo()
            ->whereIn('id', $disponibles)
            ->paginate(12);


        return [
            'pagination' => [
                'total'        => $productos->total(),
                'current_page' => $productos->currentPage(),
                'per_page'     => $productos->perPage(),
                'last_page'    => $productos->lastPage(),
                'from'         => $productos->firstItem(),
                'to'           => $productos->lastItem(),
            ],
            'productos' => $productos
        ];