app/Http/Controllers/HomeController.php

                function (Builder $query) {
                    $query->where('slider_principal', 'Si');
                })
                ->with(['producto.tipo:id,nombre','color:id,nombre','imagenes'])
                // ->where('activo', 'Si')
                ->activo()
                ->whereIn('id', $disponibles)
                ->get();


            $producto_mas_visto = ColorProducto::with(['producto.tipo:id,nombre',
                'color:id,nombre','imagenes'])
                // ->where('visitas', '>', '0')
                // ->where('activo', 'Si')
                ->visitas()
                ->activo()
                ->whereIn('id', $disponibles)
                ->orderBy('visitas', 'DESC')
                ->take(5)
                ->get();


            $productos_vendidos = ColorProducto::with(['producto.tipo:id,nombre','color:id,nombre','imagenes'])
                ->join('producto_referencia', 'color_producto.id', 'producto_referencia.color_producto_id')
                ->join('producto_venta', 'producto_referencia.id', 'producto_venta.producto_referencia_id')
                // ->where('activo', 'Si')
                ->activo()
                ->where('producto_referencia.stock', '>', '0')
                ->select('color_producto.*', DB::raw('SUM(producto_venta.cantidad) as cantidad'))
                ->groupBy('color_producto.id')
                ->orderBy('cantidad', 'DESC')
                ->take(5)
                ->get();
---
select * from `productos` where `productos`.`id` in (11, 12, 23, 38, 43, 45)
select `id`, `nombre` from `tipos` where `tipos`.`id` in (3, 5, 6)
select * from `productos` where `productos`.`id` in (8, 9, 11, 23)
select `id`, `nombre` from `tipos` where `tipos`.`id` in (2, 3, 5)
select * from `productos` where `productos`.`id` in (8, 11, 23)
select `color_producto`.*, SUM(producto_venta.cantidad) as cantidad from `color_producto` inner join `producto_referencia` on `color_producto`.`id` = `producto_referencia`.`color_producto_id` inner join `producto_venta` on `producto_referencia`.`id` = `producto_venta`.`producto_referencia_id` where `activo` = 'Si' and `producto_referencia`.`stock` > '0' group by `color_producto`.`id` order by `cantidad` desc limit 5

                function (Builder $query) {
                    $query->where('estado', '2');
                })
                ->with(['producto.tipo:id,nombre','color:id,nombre','imagenes'])
                // ->where('activo', 'Si')
                ->activo()
                ->whereIn('id', $disponibles)
                ->orderBy('id', 'DESC')
                ->take(5)
                ->get();
---
select * from `productos` where `productos`.`id` in (8, 9, 11, 23)
select `id`, `nombre` from `tipos` where `tipos`.`id` in (2, 3, 6)

                $query->where('estado', '1');
            })
            ->with(['producto.tipo:id,nombre','color:id,nombre','imagenes'])
            // ->where('activo', 'Si')
            ->activo()
            ->whereIn('id', $disponibles)
            ->orderBy('id', 'DESC')
            ->take($cantidad)
            ->get();
---
select * from `productos` where `productos`.`id` in (23, 43, 45)
select `id`, `nombre` from `tipos` where `tipos`.`id` in (3, 6)