app/Http/Controllers/HomeController.php

    public function index()
    {
        // $productoSlider = Producto::join('color_producto','productos.id','color_producto.producto_id')
        // ->join('imagenes','color_producto.id','imagenes.imageable_id')
        // ->join('producto_referencia','color_producto.id','producto_referencia.color_producto_id')
        // ->select('productos.*','color_producto.slug as slug','color_producto.id as cop',
        // 'imagenes.url as imagen')
        // ->where('productos.slider_principal', 'Si')
        // ->where('color_producto.activo', 'Si')
        // ->where('imagenes.imageable_type', 'App\ColorProducto')
        // ->where('producto_referencia.stock', '>', '0')
        // ->groupBy('color_producto.id')
        // ->get();

        $disponibles = ProductoReferencia::disponibles();

        $productoSlider = ColorProducto::whereHas('producto', function (Builder $query) {
            $query->where('slider_principal', 'Si');
        })
        ->with(['producto:id,nombre,precio_actual,tipo_id','producto.tipo:id,nombre','color:id,nombre',
            'imagenes' => function($query) {
                $query->select('id', 'url', 'imageable_id');
            }
        ])
        // ->where('activo', 'Si')
        ->activo()
        ->whereIn('id', $disponibles)
        ->get();
---
select `id`, `nombre`, `precio_actual`, `tipo_id` from `productos` where `productos`.`id` in (11, 12, 23, 38, 43, 45)

        ])
        ->join('producto_referencia', 'color_producto.id', 'producto_referencia.color_producto_id')
        ->join('producto_venta', 'producto_referencia.id', 'producto_venta.producto_referencia_id')
        // ->where('activo', 'Si')
        ->activo()
        ->where('producto_referencia.stock', '>', '0')
        ->select('color_producto.*', DB::raw('SUM(producto_venta.cantidad) as cantidad'))
        ->groupBy('color_producto.id')
        ->orderBy('cantidad', 'DESC')
        ->take(5)
        ->get();
---
select `color_producto`.*, SUM(producto_venta.cantidad) as cantidad from `color_producto` inner join `producto_referencia` on `color_producto`.`id` = `producto_referencia`.`color_producto_id` inner join `producto_venta` on `producto_referencia`.`id` = `producto_venta`.`producto_referencia_id` where `activo` = 'Si' and `producto_referencia`.`stock` > '0' group by `color_producto`.`id` order by `cantidad` desc limit 5