app/Http/Controllers/OrdersController.php

select * from `facturas` where `facturas`.`id` in (118, 119, 120, 121, 122)
select * from `pedidos` where `pedidos`.`venta_id` in (129, 130, 131, 132, 133)
---
    public function index(Request $request)
    {
        $busqueda = $request->get('busqueda');

    //     $pedidos = Pedido::orWhere('pedidos.id','like',"%$busqueda%")
    //    //->orWhere('pedidos.fecha','like',"%$busqueda%")
    //     //orWhere('facturas.id','like',"%$busqueda%")
    //     ->orWhere('ventas.valor','like',"%$busqueda%")
    //     ->join('ventas','pedidos.venta_id', '=','ventas.id')
    //     ->join('facturas','ventas.factura_id', '=', 'facturas.id')
    //     ->select('ventas.valor','facturas.prefijo','facturas.consecutivo', 'pedidos.*')
    //     ->where('ventas.cliente_id', auth()->user()->cliente->id)
    //     ->where('ventas.estado', '!=', 3)
    //     ->orderBy('pedidos.created_at', 'DESC')
    //     ->paginate(5);

        try {

            $pedidos = Venta::with(['pedido', 'factura'])
                ->orWhere('valor','like',"%$busqueda%")
                ->where('cliente_id', auth()->user()->cliente->id)