app/Http/Controllers/ProductController.php

select * from `categorias` where `categorias`.`id` in (2)
select * from `color_producto` where `color_producto`.`slug` = 'valetas-coleccion-primavera-cafe' limit 1
select * from `productos` where `productos`.`id` in (38)
select * from `subcategorias` where `subcategorias`.`id` in (4)
select * from `color_producto` where `producto_id` = 38 and `id` != 18
---
    public function show($slug)
    {

        try {

            $producto = ColorProducto::with(['imagenes:imageable_id,url', 'color:id,nombre',
                'producto.tipo.subcategoria.categoria'])
                ->where('color_producto.slug',$slug)
                ->firstOrFail();

            $related_products = ColorProducto::with('imagenes:imageable_id,url')
                ->where('producto_id', $producto->producto_id)
                ->where('id', '!=', $producto->id)
                ->get();