app/Http/Controllers/UserController.php

select * from `users` where `slug` = 'jhon-luis-rojas-varela' and `id` = 2 limit 1
---
    public function show($slug)
    {
        try {

            $user = User::where('slug', $slug)
            ->where('id', auth()->user()->id)
            ->first();