app/Http/Controllers/Admin/ChatController.php

    public function store(Request $request)
    {
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}

        try {

            $chat = new Chat();
            $chat->from_id = auth()->user()->id;
            $chat->to_id = $request->cliente;
            $chat->mensaje = $request->mensaje;
            $chat->fecha = \Carbon\Carbon::now();

            $chat->save();

            $data = array();
            $data['chats'] = array();

            $msg = Chat::with('user.imagene')
            ->where('id', $chat->id)
            ->first();
---
insert into `chats` (`from_id`, `to_id`, `mensaje`, `fecha`, `updated_at`, `created_at`) values (2, 3, 'Buenas tardes', '2023-03-15 13:21:04', '2023-03-15 13:21:04', '2023-03-15 13:21:04')
select * from `chats` where `id` = 91 limit 1
select * from `users` where `users`.`id` in (2)

    public function lastMessage(Request $request)
    {
        //obtener los mensajes que se muestran en las notificaciones de chats del admin
        if ( ! request()->ajax()) {
			abort(401, 'Acceso denegado');
		}


        try {

            $user = auth()->user()->id;

            $recents = Chat::selectRaw('MAX(id)')
                ->whereNotIn('from_id', [$user])
                ->whereNull('read_at')
                ->groupBy('from_id')
                ->get();

            $chats = Chat::with('user.imagene')
                ->whereIn('id', $recents)
                ->orderBy('created_at', 'DESC')
                ->get();
---
select MAX(id) from `chats` where `from_id` not in (2) and `read_at` is null group by `from_id`
select * from `chats` where `id` in (94) order by `created_at` desc
select * from `users` where `users`.`id` in (3)