app/Http/Controllers/Admin/ClienteController.php

    public function index(Request $request)
    {
        $keyword = $request->get('keyword');

        $clientes = User::with('cliente')
        ->where('users.nombres','like',"%$keyword%")
        ->orWhere('users.apellidos','like',"%$keyword%")
        ->orWhere('users.identificacion','like',"%$keyword%")
        ->orWhere('users.direccion','like',"%$keyword%")
        ->orWhere('users.telefono','like',"%$keyword%")
        ->orWhere('users.email','like',"%$keyword%")
        // join('users','clientes.user_id', '=', 'users.id')
        // ->where('users.nombres','like',"%$keyword%")
        // ->orWhere('users.apellidos','like',"%$keyword%")
        // ->orWhere('users.identificacion','like',"%$keyword%")
        // ->orWhere('users.direccion','like',"%$keyword%")
        // ->orWhere('users.telefono','like',"%$keyword%")
        // ->orWhere('users.email','like',"%$keyword%")
        // ->select('clientes.id','users.nombres', 'users.apellidos', 'users.identificacion',
        // 'users.direccion','users.telefono','users.email', 'users.departamento', 'users.municipio')
        ->paginate(5);
---
select * from `clientes` where `clientes`.`user_id` in (2, 3, 4, 8, 9)
select count(*) as aggregate from `users` where `users`.`nombres` like '%%' or `users`.`apellidos` like '%%' or `users`.`identificacion` like '%%' or `users`.`direccion` like '%%' or `users`.`telefono` like '%%' or `users`.`email` like '%%'

    public function show($id)
    {
        // $cliente = User::with('imagene')
        // ->join('clientes','users.id', 'clientes.user_id')
        // ->where('clientes.id', $id)
        // ->select('clientes.id','users.*')
        // ->firstOrFail();

        // $pedidos = Pedido::join('ventas','pedidos.venta_id','ventas.id')
        // ->join('clientes','ventas.cliente_id','clientes.id')
        // ->join('facturas','ventas.factura_id', 'facturas.id')
        // ->where('clientes.id',$id)
        // ->where('ventas.estado', '!=', '3')
        // ->select('pedidos.id','pedidos.fecha', 'ventas.valor', 'facturas.prefijo','facturas.consecutivo')
        // ->paginate(10);

        $pedidos = Venta::with(['pedido', 'factura', 'cliente.user.imagene'])
            ->where('cliente_id', $id)
            // ->where('estado', '!=', '3')
            ->estado();
            // ->paginate(10);



        $total_general = $pedidos->sum('valor');

        $pedidos = $pedidos->paginate(10);


        $total_pagina = $pedidos->sum('valor');
---
select * from `clientes` where `id` = 3 limit 1
select * from `users` where `users`.`id` in (3)