app/Http/Controllers/Admin/EnviosController.php

select * from `clientes` where `clientes`.`id` in (1)
select * from `envios` order by `id` asc
select * from `ventas` where `ventas`.`id` in (16, 17)
select `id`, `nombres`, `apellidos` from `users` where `users`.`id` in (2)
---
    public function index()
    {

        $envios = Envio::with('venta.cliente.user:id,nombres,apellidos')
            ->orderBy('id')->get();

select * from `clientes` where exists (select * from `ventas` where `clientes`.`id` = `ventas`.`cliente_id`)
select * from `users` where `users`.`id` in (2, 3, 10)
select `id`, `cliente_id` from `ventas` where `ventas`.`id` in (16)
---
    public function edit(Envio $envio)
    {
        $clientes = Cliente::with('user')
            ->whereHas('ventas')
            ->get();

        $envio->load('venta:id,cliente_id');