app/Http/Controllers/Admin/OrdersController.php

select * from `clientes` where `clientes`.`id` in (1)
select * from `users` where `users`.`id` in (2)
select * from `ventas` where `ventas`.`id` in (133)
---
    public function reportePedidosPdf()
    {
        // $pedidos = Pedido::join('ventas','pedidos.venta_id','=','ventas.id')
        // ->join('clientes','ventas.cliente_id','=','clientes.id')
        // ->join('users','clientes.user_id','=','users.id')
        // ->where('ventas.estado', '!=', '3')
        // ->select('pedidos.*','ventas.valor','users.nombres','users.apellidos')
        // ->orderBy('pedidos.fecha')
        // ->get();

        try {


            $pedidos = Pedido::whereHas('venta',function (Builder $query) {
                $query->where('estado', '!=', '3');
            })
            ->with('venta.cliente.user')
            ->orderBy('created_at', 'DESC')
            ->get();