app/Http/Controllers/Admin/ProductController.php

select count(*) as aggregate from `productos` where `productos`.`nombre` like '%%' or `productos`.`id` like '%%'
---
    public function index(Request $request)
    {
        $busqueda = $request->get('busqueda');

        $productos = Producto::orWhere('productos.nombre', 'like', "%$busqueda%")
            ->orWhere('productos.id', 'like', "%$busqueda%")
            ->with('colors:id')
            ->withCount('colors')
            ->paginate(10);