app/Http/Controllers/Admin/StockController.php

select * from `producto_referencia` where exists (select * from `color_producto` where `producto_referencia`.`color_producto_id` = `color_producto`.`id` and `activo` = 'Si') and `stock` > '0' order by `color_producto_id` asc limit 5 offset 0
select `id`, `nombre` from `productos` where `productos`.`id` in (9, 11, 12, 13)
select `id`, `nombre` from `tallas` where `tallas`.`id` in (1, 2)
select count(*) as aggregate from `producto_referencia` where exists (select * from `color_producto` where `producto_referencia`.`color_producto_id` = `color_producto`.`id` and `activo` = 'Si') and `stock` > '0'
select * from `tallas` where `tallas`.`id` in (1, 2)
---
    public function index(Request $request)
    {

        $busqueda = $request->get('busqueda');

        try {

            $productos = ProductoReferencia::whereHas('colorProducto', function (Builder $query) {
                $query->where('activo', 'Si');
            })
            ->with(['talla', 'colorProducto'])//faltan los filtros
            ->where('stock', '>', '0')
            ->when($busqueda, function ($query) use ($busqueda) {
                return $query->whereHas('colorProducto.producto', function (Builder $query) use($busqueda){
                    $query->where('nombre','like',"%$busqueda%");
                })
                ->orWhereHas('colorProducto.color', function (Builder $query) use($busqueda){
                    $query->where('nombre','like',"%$busqueda%");
                });
            })
            ->orderBy('color_producto_id')
            ->paginate(5);