app/Http/Controllers/Admin/StockController.php

select * from `color_producto` where `color_id` = 3 and `producto_id` = 8 limit 1
select `id`, `slider_principal`, `estado` from `productos` where `productos`.`id` in (8)
select * from `producto_referencia` where `color_producto_id` = 8 and `talla_id` = 3 limit 1
---
    public function store(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'producto_id'   => 'required',
            'talla_id'      => 'required',
            'color_id'      => 'required',
            'cantidad'      => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json($validator->errors(), 422);
        }

        try {

            $colorproducto = ColorProducto::where('color_id', $request->color_id)
                ->where('producto_id', $request->producto_id)
                ->with('producto:id,slider_principal,estado')
                ->first();

            $referencia = ProductoReferencia::where('color_producto_id', $colorproducto->id)
                ->where('talla_id', $request->talla_id)
                ->first(); // buscar la referencia

select `id`, `color_id`, `producto_id`, `slug` from `color_producto` where `color_producto`.`id` in (1, 2, 4, 5)
select `id`, `nombre` from `productos` where `productos`.`id` in (9, 11, 12, 13)
select `id`, `nombre` from `tallas` where `tallas`.`id` in (1, 2)
select count(*) as aggregate from `producto_referencia` where exists (select * from `color_producto` where `producto_referencia`.`color_producto_id` = `color_producto`.`id` and `activo` = 'Si') and `stock` > '0'
---
    public function loadStocks(Request $request)
    {

        try {

            $busqueda = $request->get('busqueda');


            $productos = ProductoReferencia::whereHas('colorProducto', function (Builder $query) {
                $query->where('activo', 'Si');
            })
            ->with(['talla:id,nombre', 'colorProducto:id,color_id,producto_id,slug',
                'colorProducto.producto:id,nombre', 'colorProducto.color:id,nombre',
                'colorProducto.imagenes' => function($query) {
                    $query->select('id', 'url', 'imageable_id');
                }
            ])
            ->where('stock', '>', '0')
            ->when($busqueda, function ($query) use ($busqueda) {
                return $query->whereHas('colorProducto.producto', function (Builder $query) use($busqueda){
                    $query->where('nombre','like',"%$busqueda%");
                })
                ->orWhereHas('colorProducto.color', function (Builder $query) use($busqueda){
                    $query->where('nombre','like',"%$busqueda%");
                });
            })
            ->orderBy('color_producto_id')
            ->paginate(5);