app/Http/Controllers/Admin/VentaController.php

    public function index(Request $request)
    {

        $busqueda = $request->busqueda;

        $estado = $request->estado;


        try {

            $ventas = Venta::when($estado, function ($query) use ($estado) {
                return $query->orWhere('estado', $estado)
                ->with('cliente');
            },
            function ($query) use ($busqueda) {
                return $query->orWhere('valor', 'like',"%$busqueda%")
                ->orWhereHas('cliente.user', function (Builder $query)  use ($busqueda)  {
                    $query->where('nombres', 'like',"%$busqueda%");
                });
            })
            ->with(['pedido:id,venta_id', 'cliente:id,user_id', 'cliente.user:id,nombres,apellidos'])
            ->withCount('devoluciones')
            ->orderBy('id', 'DESC')
            ->paginate(5);
---
select `id`, `nombres`, `apellidos` from `users` where `users`.`id` in (2)
select `id`, `user_id` from `clientes` where `clientes`.`id` in (1)
select * from `ventas` where `valor` like '%%' or exists (select * from `clientes` where `ventas`.`cliente_id` = `clientes`.`id` and exists (select * from `users` where `clientes`.`user_id` = `users`.`id` and `nombres` like '%%')) order by `id` desc limit 5 offset 0
select `id`, `venta_id` from `pedidos` where `pedidos`.`venta_id` in (129, 130, 131, 132, 133)